jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
/*
 ******************************************************************************
 * @file           : main.c
 * @author         : Juan Jose Giraldo Arbelaez
 * @brief          : Traductor de texto a Braille — versión integrada
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 ******************************************************************************
 *
 * DESCRIPCIÓN GENERAL
 * El sistema recibe una palabra por el puerto serial y la recorre letra por
 * letra a un ritmo configurable. En cada letra, la pantalla OLED muestra la
 * letra en grande junto a su traducción en una celda Braille de 3x2 puntos y
 * el tiempo de espera vigente. Un encoder rotativo ajusta ese tiempo entre 1,
 * 2 y 3 segundos, y el sistema confirma la selección en voz alta a través del
 * amplificador. El pulsador del encoder pausa y reanuda el recorrido.
 *
 * La máscara de 6 bits que hoy dibuja la celda en la pantalla será mañana la
 * que decida qué punto sube y cuál baja en los seis servomotores: una sola
 * fuente de verdad para las dos representaciones.
 *
 * ─── Mapa de periféricos ────────────────────────────────────────────────────
 *  TIM10  → Blinky en PH1 cada 250 ms y base de tiempo del
 *           secuenciador de letras                               [CON IRQ]
 *  TIM1   → Encoder rotativo, DT = PA8 / CLK = PA9 (AF1)         [SIN IRQ]
 *  GPIO   → PA10 pulsador del encoder (entrada con pull-up)
 *           PA11 pin SD del amplificador (habilitación / silencio)
 *           PH1  LED de estado
 *  I2S2   → Full-duplex, 16 kHz, 32 bit:
 *             CK  = PB13 (AF5)  → BCLK de micrófono y amplificador
 *             WS  = PB12 (AF5)  → LRC  de micrófono y amplificador
 *             SD  = PB15 (AF5)  → DIN del amplificador (salida)
 *             ext = PB14 (AF6)  → SD del micrófono (entrada)
 *  DMA1_S4→ Transmisión hacia el amplificador (SPI2_TX, canal 0) [CON IRQ]
 *  DMA1_S3→ Recepción desde el micrófono (I2S2ext_RX, canal 3)   [CON IRQ]
 *  I2C1   → OLED SSD1306, SCL = PB8, SDA = PB9 (AF4), 100 kHz    [SIN IRQ]
 *  USART2 → 115200-8N1 por el VCP del ST-LINK,
 *           TX = PA2 (AF7) por sondeo,
 *           RX = PA3 (AF7) por interrupción                      [CON IRQ]
 *
* ─── Servomotores (un punto Braille por servo) ──────────────────────────────
 *  Punto 1 → PA6 (TIM3_CH1)     Punto 4 → PB1 (TIM3_CH4)
 *  Punto 2 → PA7 (TIM3_CH2)     Punto 5 → PB7 (TIM4_CH2)
 *  Punto 3 → PB6 (TIM4_CH1)     Punto 6 → PB0 (TIM3_CH3)
 * ─── Uso ────────────────────────────────────────────────────────────────────
 *  Escribir la palabra en el terminal y pulsar Enter: el recorrido arranca en
 *  la primera letra y se repite en bucle al terminar.
 *  Girar el encoder  → cambia el tiempo (3 clics por opción) y lo anuncia
 *  Pulsar el encoder → pausa / reanuda el recorrido
 ******************************************************************************
 */

#include "stm32f4xx_hal.h"
#include "ssd1306.h"
#include "braille.h"
#include "clips_voz.h"
#include <stdio.h>
#include <string.h>

/* ═══════════════════════ Definiciones de la aplicación ═══════════════════ */

/* ── Texto ── */
#define TEXT_MAX_LEN          32u   /* capacidad del buffer de la palabra   */

/* ── Base de tiempo ── */
#define TICKS_PER_SECOND       4u   /* el tick de TIM10 es de 250 ms        */

/* ── Encoder ──
 * ENC_COUNTS_PER_CLICK es propiedad del HARDWARE: el timer en cuadratura x4
 * cuenta cuatro flancos por clic mecánico. ENC_CLICKS_PER_STEP es decisión
 * de uso: con solo tres opciones, exigir tres clics por cambio da un tacto
 * mucho más controlable que uno.                                           */
#define ENC_COUNTS_PER_CLICK   4
#define ENC_CLICKS_PER_STEP    3
#define ENC_COUNTS_PER_STEP   (ENC_COUNTS_PER_CLICK * ENC_CLICKS_PER_STEP)

/* Tiempo que el mando debe quedar quieto antes de anunciar por voz. Se mide
 * con HAL_GetTick (1 ms de resolución) y no con el tick de 250 ms, que sería
 * demasiado grueso para que la respuesta se sienta natural.                */
#define VOZ_ESPERA_MS        400u

/* ── Opciones de tiempo de espera entre letras, en segundos ── */
#define OPCIONES               3u
static const uint8_t tiempos[OPCIONES] = { 1u, 2u, 3u };

/* ── Servomotores ──
 * Cadena de reloj: SYSCLK 96 MHz → APB1 48 MHz → reloj de TIM3/TIM4 96 MHz.
 * Los timers de APB1 reciben el doble del reloj del bus cuando su divisor no
 * es 1, particularidad del F411 que aquí conviene tener presente.
 *
 * PSC = 95    → 96 MHz / 96 = 1 MHz  (1 microsegundo por cuenta)
 * ARR = 19999 → periodo de 20 000 us = 20 ms = 50 Hz, lo que espera el servo
 *
 * Con esa base, el valor cargado en el registro de comparación ES
 * directamente el ancho del pulso en microsegundos, que es la magnitud en la
 * que se especifican los servos.
 */
#define SERVO_PSC          95u
#define SERVO_ARR       19999u

/* Anchos de pulso de las dos posiciones del punto Braille. El SG92R recorre
 * sus 180 grados entre 500 y 2400 us; aquí solo hacen falta dos posiciones
 * separadas lo justo para que el punto suba y baje. Ajustar según el
 * mecanismo. */
#define SERVO_PULSO_BAJO  1000u    /* punto retraído  */
#define SERVO_PULSO_ALTO  1600u    /* punto levantado */

/*
 * El optoacoplador en configuración de colector abierto INVIERTE la señal:
 * cuando el pin del micro está en alto, el fototransistor conduce y tira la
 * línea del servo a nivel bajo. El modo PWM2 emite la señal invertida en el
 * propio timer, y la doble inversión entrega al servo el pulso correcto.
 * Si el servo no responde o tiembla sin control, probar con TIM_OCMODE_PWM1.
 */
#define SERVO_PWM_MODE    TIM_OCMODE_PWM2

/* Cuántos servos están cableados. Subir de uno en uno a medida que se
 * conecten; los no declarados ni se configuran ni se mueven. */
#define SERVOS_CONECTADOS   6u

/* ── Audio ──
 * Formato de 32 bits: cada trama ocupa cuatro medias palabras en memoria,
 * [L_alto][L_bajo][R_alto][R_bajo]. 256 tramas a 16 kHz son 16 ms.         */
#define BUF_FRAMES           256u
#define BUF_HALFWORDS       (BUF_FRAMES * 4u)
#define BUF_SAMPLES         (BUF_FRAMES * 2u)

/* ── Geometría de la interfaz (pantalla de 128x64) ──
 * El panel es bicolor: las 16 primeras filas son amarillas y el resto azul,
 * con una franja oscura de un par de filas en la transición. Todo el
 * contenido gráfico empieza por debajo de y = 18 para no invadir el
 * amarillo; en particular, la primera fila de la celda tiene que estar lo
 * bastante abajo como para que el círculo de radio 5 quepa entero en la
 * zona azul (24 - 5 = 19).
 *
 * Disposición horizontal:  letra → flecha → celda Braille → tiempo
 */
#define UI_SEP_Y            10     /* línea separadora, en zona amarilla    */

#define UI_LETTER_X          4     /* letra grande, pegada a la izquierda   */
#define UI_LETTER_Y         22
#define UI_LETTER_SCALE      4     /* 5x7 escalado x4 = 20x32 px            */

