jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
#define UI_ARROW_X0         30     /* flecha entre la letra y la celda      */
#define UI_ARROW_X1         50
#define UI_ARROW_Y          36

#define UI_CELL_COL_L       62     /* celda desplazada a la izquierda para  */
#define UI_CELL_COL_R       84     /* dejar sitio al tiempo                 */
#define UI_CELL_ROW_1       24
#define UI_CELL_ROW_2       36
#define UI_CELL_ROW_3       48
#define UI_DOT_R             5

#define UI_TIME_X           99     /* tiempo, a la derecha de la celda      */
#define UI_TIME_Y           30
#define UI_STATE_X           0     /* aviso de pausa, esquina inferior      */
#define UI_STATE_Y          56

/* Estados de la máquina de estados finitos */
typedef enum
{
    FSM_IDLE = 0,        /* sin eventos pendientes                          */
    FSM_PROC_UART,       /* llegó un carácter por el puerto serial          */
    FSM_PROC_ENCODER,    /* el mando giró un paso completo                  */
    FSM_PROC_BOTON,      /* se pulsó el mando → pausa / reanuda             */
    FSM_NEXT_LETTER,     /* venció el tiempo → avanzar de letra             */
    FSM_ANUNCIAR,        /* el mando se detuvo → anunciar el tiempo         */
    FSM_REFRESH_OLED     /* redibujar la pantalla                           */
} fsm_state_t;

/* ═══════════════════════ Handles de periféricos (globales) ════════════════ */
/* Globales porque stm32f4xx_it.c los referencia con 'extern' para pasarlos
 * a los HAL_xxx_IRQHandler() dentro de cada ISR.                            */

TIM_HandleTypeDef  htim1;         /* encoder                    */
TIM_HandleTypeDef  htim10;        /* blinky y base de tiempo    */
TIM_HandleTypeDef  htim3;         /* PWM de los servos 1 a 4    */
TIM_HandleTypeDef  htim4;         /* PWM de los servos 5 y 6    */
I2S_HandleTypeDef  hi2s2;         /* audio full-duplex          */
DMA_HandleTypeDef  hdma_i2s2_tx;  /* hacia el amplificador      */
DMA_HandleTypeDef  hdma_i2s2_rx;  /* desde el micrófono         */
I2C_HandleTypeDef  hi2c1;         /* pantalla OLED              */
UART_HandleTypeDef huart2;        /* puerto serial              */

/* ═══════════════════════ Variables de la aplicación ═══════════════════════ */

/* Banderas de evento: las escriben las ISR/callbacks y las consume la FSM.
 * 'volatile' es obligatorio porque cambian fuera del flujo normal y sin él
 * el compilador podría optimizar las lecturas del lazo.                    */
static volatile uint8_t flag_rx      = 0;   /* carácter recibido            */
static volatile uint8_t flag_next    = 0;   /* venció el tiempo de espera   */
static volatile uint8_t flag_refresh = 0;   /* hay que redibujar            */
static volatile uint8_t rx_byte      = 0;   /* buffer de recepción (1 byte) */

/* ── Texto en curso ── */
static char    text_buf[TEXT_MAX_LEN + 1] = {0};
static uint8_t text_len = 0;      /* letras válidas                         */
static uint8_t text_idx = 0;      /* letra que se muestra ahora             */

/* Buffer de ensamblado de la recepción: los caracteres se acumulan aquí
 * hasta el fin de línea, para poder seguir escribiendo mientras la palabra
 * anterior sigue corriendo.                                                */
static char    rx_line[TEXT_MAX_LEN + 1] = {0};
static uint8_t rx_len = 0;
static uint8_t rx_utf8_pending = 0;   /* se recibió el 0xC3 de la 'ñ'       */

/* ── Estado del secuenciador ── */
static uint8_t opcion_idx = 0;    /* índice dentro de tiempos[]             */
static uint8_t paused     = 0;    /* 1 = recorrido detenido                 */
static uint8_t running    = 0;    /* 1 = hay palabra en curso               */

/* ── Encoder y pulsador ── */
static uint16_t enc_last_cnt = 0;
static uint8_t  sw_prev      = 1;

/* ── Anuncio por voz ── */
static uint8_t  voz_pendiente   = 0;
static uint32_t t_ultimo_cambio = 0;

/* ── Audio ── */
static uint16_t tx_buf[BUF_HALFWORDS];
static uint16_t rx_buf[BUF_HALFWORDS];

/* Reproductor de clips: el callback lee de aquí y el lazo principal solo
 * arranca o detiene.                                                       */
static const int16_t * volatile clip_datos  = 0;
static volatile uint32_t        clip_largo  = 0;
static volatile uint32_t        clip_pos    = 0;
static volatile uint8_t         clip_activo = 0;

static fsm_state_t fsm_state = FSM_IDLE;

/* ═══════════════════════ Prototipos ═══════════════════════════════════════ */

static void SystemClock_Config(void);
static void gpio_Init(void);
static void tim10_Init(void);
static void tim1_encoder_Init(void);
static void dma_Init(void);
static void i2s2_Init(void);
static void i2c1_Init(void);
static void usart2_Init(void);
static void servos_Init(void);
static uint8_t mask_LetraActual(void);

static void fsm_Run(void);
static void trap_Error(void);
static void encoder_Poll(void);
static void boton_Poll(void);
static void text_Start(void);
static void clip_Reproducir(const int16_t *datos, uint32_t largo);
static void anuncio_Programar(void);
static void servos_Aplicar(uint8_t mask);
static void ui_DrawArrow(uint8_t x0, uint8_t x1, uint8_t y);
static void ui_Draw(void);
static void ui_DrawBrailleCell(uint8_t mask);
static void print(const char *s);

/* ═══════════════════════ Programa principal ═══════════════════════════════ */

int main(void)
{
    HAL_Init();             /* SysTick a 1 ms, caché de Flash, NVIC         */
    SystemClock_Config();   /* PLL a 96 MHz y PLLI2S a 76.8 MHz             */

    gpio_Init();
    usart2_Init();          /* primero el serial, para poder informar       */
    print("\r\n=== TRADUCTOR DE TEXTO A BRAILLE ===\r\n");

    tim10_Init();           print("  Base de tiempo OK\r\n");
    tim1_encoder_Init();    print("  Encoder OK\r\n");
    servos_Init();          print(" Servos OK\r\n");
    dma_Init();             print("  DMA OK\r\n");
    i2s2_Init();            print("  Audio OK\r\n");
    i2c1_Init();            print("  I2C OK\r\n");

    SSD1306_SetI2C(&hi2c1);
    SSD1306_Init();
    print("  Pantalla OK\r\n\r\n");

    /* Arrancar el audio: a partir de aquí el DMA mantiene el flujo en las
     * dos direcciones sin intervención del procesador.                     */
    if (HAL_I2SEx_TransmitReceive_DMA(&hi2s2, tx_buf, rx_buf, BUF_SAMPLES)
        != HAL_OK)
    {
        print("  [ERROR] No arranco el audio\r\n");
        trap_Error();
    }

    /* Pantalla de bienvenida */
    SSD1306_Fill(0);
    SSD1306_WriteString(0, 0,  "TRADUCTOR BRAILLE");
    SSD1306_DrawHLine(0, 127, UI_SEP_Y);
    SSD1306_WriteString(0, 20, "Escriba una palabra");
    SSD1306_WriteString(0, 30, "y pulse Enter.");
    SSD1306_WriteString(0, 44, "Encoder: tiempo");
    SSD1306_WriteString(0, 54, "Boton: pausa");
    SSD1306_UpdateScreen();

    {
    	const char hello[] =
    			"\r\n== Traductor de texto a Braille ==\r\n"
    			"Escriba una palabra y pulse Enter.\r\n"
    			"Encoder: tiempo entre letras (1/2/3 s). Boton: pausa.\r\n\r\n> ";
    	HAL_UART_Transmit(&huart2, (uint8_t *)hello,
    			(uint16_t)strlen(hello), 200);
    }

