jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
    /* Armar la recepción del primer carácter por interrupción */
    HAL_UART_Receive_IT(&huart2, (uint8_t *)&rx_byte, 1);

    /* Lazo de aplicación: no bloquea. Los periféricos avisan por banderas;
     * aquí solo se sondean encoder y pulsador y se despachan los eventos.  */
    while (1)
    {
        encoder_Poll();
        boton_Poll();
        fsm_Run();
    }
}

/* ═══════════════════════════════════════════════════════════════════════════
 *                        FUNCIONES DE CONFIGURACIÓN
 * ═══════════════════════════════════════════════════════════════════════════ */

/* ═══════════════════ Reloj del sistema y reloj de audio ═══════════════════ */
/*
 * El sistema necesita DOS lazos de enganche de fase: el PLL principal para
 * el reloj del procesador y el PLLI2S para el audio.
 *
 *   VCO_in = HSI / PLLM = 16 MHz / 8 = 2 MHz     (recomendado: 1-2 MHz)
 *   PLL:     VCO = 2 x 96  = 192 MHz  →  SYSCLK = 192/2 = 96 MHz
 *   PLLI2S:  VCO = 2 x 192 = 384 MHz  →  I2SCLK = 384/5 = 76.8 MHz
 *
 * La elección de 76.8 MHz no es arbitraria: es el valor que hace que los
 * divisores enteros del periférico I2S den 16 000,00 Hz exactos. Con formato
 * de 32 bits el periférico divide entre 64 x (2 x I2SDIV + ODD) = 64 x 75.
 *
 * PLLI2SM: en el STM32F411 el PLLI2S tiene su PROPIO divisor de entrada,
 * independiente del PLLM del PLL principal. Omitirlo lo deja en cero y el
 * PLL de audio nunca engancha; el fallo se manifiesta más tarde, al
 * inicializar el I2S, lo que despista bastante.
 *
 * Divisores de bus a 96 MHz (respetando los máximos del F411):
 *   AHB = 96 MHz    APB1 = 48 MHz (máx. 50)    APB2 = 96 MHz (máx. 100)
 * Por encima de 90 MHz la Flash necesita 3 estados de espera y el regulador
 * debe estar en Scale 1.
 */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef       RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef       RCC_ClkInitStruct = {0};
    RCC_PeriphCLKInitTypeDef PeriphClkInit     = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState            = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState        = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource       = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM            = 8;    /* también entra al I2S   */
    RCC_OscInitStruct.PLL.PLLN            = 96;
    RCC_OscInitStruct.PLL.PLLP            = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ            = 4;    /* rama USB/SDIO, sin uso */
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) { trap_Error(); }

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_HCLK   |
                                       RCC_CLOCKTYPE_PCLK1  |
                                       RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
    {
        trap_Error();
    }

    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_I2S;
    PeriphClkInit.PLLI2S.PLLI2SM       = 8;    /* divisor propio del F411   */
    PeriphClkInit.PLLI2S.PLLI2SN       = 192;
    PeriphClkInit.PLLI2S.PLLI2SR       = 5;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) { trap_Error(); }
}

/* ═══════════════════ GPIO: LED, pulsador y control del audio ══════════════ */
/*
 * PH1  = LED integrado de la board. PH0/PH1 son los pines del oscilador
 *        externo; como el sistema corre con HSI + PLL y no hay cristal,
 *        quedan libres como GPIO.
 * PA10 = pulsador del encoder. Entrada con pull-up: el contacto lo lleva a
 *        GND al pulsar, así que en reposo se lee 1 y pulsado 0.
 * PA11 = pin SD del amplificador. No es una entrada lógica corriente: el
 *        chip mide el VOLTAJE y con él decide entre apagado, canal derecho,
 *        mezcla o canal izquierdo. En bajo lo apaga; en alto desde un GPIO
 *        de 3.3 V lo pone en canal izquierdo, estado determinista que no
 *        depende del divisor resistivo del módulo.
 */
static void gpio_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOH_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitStruct.Pin   = GPIO_PIN_1;          /* PH1: LED de estado      */
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_11;           /* PA11: SD del ampli      */
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    /* Silenciado hasta que haya algo que reproducir: evita el siseo de
     * reposo y el chasquido del arranque.                                  */
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11, GPIO_PIN_RESET);

    GPIO_InitStruct.Pin  = GPIO_PIN_10;          /* PA10: pulsador          */
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

/* ═══════════════════════ TIM10: tick de 250 ms (IRQ) ══════════════════════ */
/*
 * Cadena de reloj:  PLL (96 MHz) → APB2 (96 MHz) → reloj de TIM10 (96 MHz)
 *
 * PSC = 9599 → tick = 96 MHz / 9600 = 10 kHz  (100 us por cuenta)
 * ARR = 2499 → update = 2500 x 100 us = 250 ms
 *
 * A 96 MHz no se puede usar un prescaler que dé 1 ms por cuenta (harían
 * falta 95 999, que no cabe en los 16 bits del registro), así que se baja la
 * resolución del tick y se sube el auto-recarga.
 *
 * Este único timer cumple dos funciones: conmutar el LED de estado y contar
 * el tiempo entre letras. Así quedan libres TIM3 y TIM4 para el PWM de los
 * seis servomotores.
 *
 * TIM10 comparte el vector TIM1_UP_TIM10_IRQn con el update de TIM1; no hay
 * conflicto porque TIM1 (encoder) no tiene interrupciones habilitadas.
 */
static void tim10_Init(void)
{
    __HAL_RCC_TIM10_CLK_ENABLE();

    htim10.Instance               = TIM10;
    htim10.Init.Prescaler         = 9599;
    htim10.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim10.Init.Period            = 2499;
    htim10.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim10.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_Base_Init(&htim10) != HAL_OK) { trap_Error(); }

