jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
    HAL_TIM_Base_Start_IT(&htim10);
    HAL_NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);
}

/* ═══════════════════════ TIM1: encoder rotativo (sin IRQ) ═════════════════ */
/*
 * El encoder se decodifica por HARDWARE en modo TI12 (cuadratura x4): el
 * contador del timer sube o baja solo siguiendo los flancos de ambos
 * canales, con filtro digital que absorbe los rebotes mecánicos. La posición
 * se lee por sondeo del registro CNT.
 *
 * Esa es la razón de que el encoder no necesite interrupciones: no hay que
 * atrapar los flancos con el procesador porque el periférico ya los cuenta.
 * Un esquema con interrupciones externas en los dos pines gastaría tiempo de
 * CPU en cada flanco y obligaría a filtrar rebotes por software.
 */
static void tim1_encoder_Init(void)
{
    GPIO_InitTypeDef        GPIO_InitStruct = {0};
    TIM_Encoder_InitTypeDef sEncoder        = {0};

    __HAL_RCC_TIM1_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* PA8/PA9 en función alternada AF1: dejan de ser GPIO y pasan a ser las
     * entradas de captura CH1/CH2 del timer                                */
    GPIO_InitStruct.Pin       = GPIO_PIN_8 | GPIO_PIN_9;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;   /* señales en reposo altas   */
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF1_TIM1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    htim1.Instance               = TIM1;
    htim1.Init.Prescaler         = 0;
    htim1.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim1.Init.Period            = 0xFFFF;     /* contador libre de 16 bits */
    htim1.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim1.Init.RepetitionCounter = 0;
    htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

    sEncoder.EncoderMode  = TIM_ENCODERMODE_TI12;
    sEncoder.IC1Polarity  = TIM_ICPOLARITY_FALLING; /* fija el sentido según
                                                       el cableado DT/CLK;
                                                       si queda invertido,
                                                       usar RISING          */
    sEncoder.IC1Selection = TIM_ICSELECTION_DIRECTTI;
    sEncoder.IC1Prescaler = TIM_ICPSC_DIV1;
    sEncoder.IC1Filter    = 0x0F;              /* filtro antirrebote máximo */
    sEncoder.IC2Polarity  = TIM_ICPOLARITY_RISING;
    sEncoder.IC2Selection = TIM_ICSELECTION_DIRECTTI;
    sEncoder.IC2Prescaler = TIM_ICPSC_DIV1;
    sEncoder.IC2Filter    = 0x0F;
    if (HAL_TIM_Encoder_Init(&htim1, &sEncoder) != HAL_OK) { trap_Error(); }

    HAL_TIM_Encoder_Start(&htim1, TIM_CHANNEL_ALL);   /* sin _IT: sin IRQ   */
}

/* ═══════════════════════ TIM3 / TIM4: PWM de los servos ═══════════════════ */
/*
 * Los seis puntos del signo generador se reparten entre dos timers porque
 * ninguno tiene seis canales. La distribución la impone el cableado físico
 * del optoacoplador:
 *
 *   TIM3 → punto 1 (PA6, CH1), punto 2 (PA7, CH2),
 *          punto 6 (PB0, CH3), punto 4 (PB1, CH4)
 *   TIM4 → punto 3 (PB6, CH1), punto 5 (PB7, CH2)
 *
 * Los dos cuelgan de APB1 y llevan configuración idéntica, así que las seis
 * señales son indistinguibles entre sí.
 *
 * Las dos bases de tiempo se inicializan siempre, aunque durante el montaje
 * solo haya un servo conectado: un timer sin canales habilitados no toma
 * ningún pin. Los canales sí se habilitan uno a uno según SERVOS_CONECTADOS,
 * de modo que solo se mueve lo que está realmente cableado.
 */
static void servos_Init(void)
{
    GPIO_InitTypeDef   GPIO_InitStruct = {0};
    TIM_OC_InitTypeDef sConfigOC       = {0};

    __HAL_RCC_TIM3_CLK_ENABLE();
    __HAL_RCC_TIM4_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /* ── Base de tiempo de TIM3: 1 us por cuenta, periodo de 20 ms ──      */
    htim3.Instance               = TIM3;
    htim3.Init.Prescaler         = SERVO_PSC;
    htim3.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim3.Init.Period            = SERVO_ARR;
    htim3.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    if (HAL_TIM_PWM_Init(&htim3) != HAL_OK) { trap_Error(); }

    /* ── Base de tiempo de TIM4: configuración gemela ──                   */
    htim4.Instance               = TIM4;
    htim4.Init.Prescaler         = SERVO_PSC;
    htim4.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim4.Init.Period            = SERVO_ARR;
    htim4.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    if (HAL_TIM_PWM_Init(&htim4) != HAL_OK) { trap_Error(); }

    /* Configuración común de los canales de comparación */
    sConfigOC.OCMode     = SERVO_PWM_MODE;   /* invertido por el opto */
    sConfigOC.Pulse      = SERVO_PULSO_BAJO; /* arrancar con el punto abajo */
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

    /* ── Servo 1 → punto 1 → PA6 (TIM3_CH1) ── */
    GPIO_InitStruct.Pin       = GPIO_PIN_6;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_1)
        != HAL_OK) { trap_Error(); }
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);

#if (SERVOS_CONECTADOS >= 2u)
    /* ── Servo 2 → punto 2 → PA7 (TIM3_CH2) ── */
    GPIO_InitStruct.Pin       = GPIO_PIN_7;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_2)
        != HAL_OK) { trap_Error(); }
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
#endif

#if (SERVOS_CONECTADOS >= 3u)
    /* ── Servo 3 → punto 3 → PB6 (TIM4_CH1) ── */
    GPIO_InitStruct.Pin       = GPIO_PIN_6;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM4;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    if (HAL_TIM_PWM_ConfigChannel(&htim4, &sConfigOC, TIM_CHANNEL_1)
        != HAL_OK) { trap_Error(); }
    HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);
#endif

#if (SERVOS_CONECTADOS >= 4u)
    /* ── Servo 4 → punto 4 → PB1 (TIM3_CH4) ── */
    GPIO_InitStruct.Pin       = GPIO_PIN_1;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_4)
        != HAL_OK) { trap_Error(); }
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
#endif

