jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
#if (SERVOS_CONECTADOS >= 5u)
    /* ── Servo 5 → punto 5 → PB7 (TIM4_CH2) ── */
    GPIO_InitStruct.Pin       = GPIO_PIN_7;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM4;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    if (HAL_TIM_PWM_ConfigChannel(&htim4, &sConfigOC, TIM_CHANNEL_2)
        != HAL_OK) { trap_Error(); }
    HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2);
#endif

#if (SERVOS_CONECTADOS >= 6u)
    /* ── Servo 6 → punto 6 → PB0 (TIM3_CH3) ── */
    GPIO_InitStruct.Pin       = GPIO_PIN_0;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_3)
        != HAL_OK) { trap_Error(); }
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
#endif
}

/* ═══════════════ DMA: un stream por dirección, ambos circulares ═══════════ */
/*
 * A 16 kHz el periférico pide una muestra cada 62 microsegundos. Atender eso
 * por interrupción consumiría el procesador que hace falta para la pantalla,
 * el encoder y, mañana, los servos. El DMA traslada las muestras por
 * hardware.
 *
 * El full-duplex necesita DOS streams, uno por bloque del periférico, y cada
 * uno tiene su correspondencia fija en el mapa del hardware:
 *
 *   Transmisión (bloque principal SPI2)   → Stream 4, canal 0
 *   Recepción   (bloque auxiliar I2S2ext) → Stream 3, canal 3
 *
 * El canal de recepción es el 3 y no el 0 porque el canal 0 del stream 3
 * corresponde a la recepción del SPI2 principal, que aquí no se usa: ese
 * bloque está dedicado a transmitir. El bloque extendido tiene su propia
 * línea de petición.
 *
 * MODO CIRCULAR: al llegar al final del buffer el DMA vuelve solo al
 * principio y avisa dos veces por vuelta, a la mitad y al final. Eso permite
 * rellenar la mitad que ya se envió mientras la otra sigue en uso, sin
 * competir nunca por la misma memoria.
 */

static void dma_Init(void)
{
    __HAL_RCC_DMA1_CLK_ENABLE();

    hdma_i2s2_tx.Instance                 = DMA1_Stream4;
    hdma_i2s2_tx.Init.Channel             = DMA_CHANNEL_0;
    hdma_i2s2_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    hdma_i2s2_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_i2s2_tx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_i2s2_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma_i2s2_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    hdma_i2s2_tx.Init.Mode                = DMA_CIRCULAR;
    hdma_i2s2_tx.Init.Priority            = DMA_PRIORITY_HIGH;
    hdma_i2s2_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_i2s2_tx) != HAL_OK) { trap_Error(); }
    __HAL_LINKDMA(&hi2s2, hdmatx, hdma_i2s2_tx);

    hdma_i2s2_rx.Instance                 = DMA1_Stream3;
    hdma_i2s2_rx.Init.Channel             = DMA_CHANNEL_3;   /* I2S2ext_RX  */
    hdma_i2s2_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hdma_i2s2_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_i2s2_rx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_i2s2_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma_i2s2_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    hdma_i2s2_rx.Init.Mode                = DMA_CIRCULAR;
    hdma_i2s2_rx.Init.Priority            = DMA_PRIORITY_HIGH;
    hdma_i2s2_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_i2s2_rx) != HAL_OK) { trap_Error(); }
    __HAL_LINKDMA(&hi2s2, hdmarx, hdma_i2s2_rx);

    HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
}

/* ═══════════════════════ I2S2 en full-duplex ══════════════════════════════ */
/*
 * El periférico por sí solo puede transmitir O recibir, no ambas cosas. Para
 * las dos direcciones el chip incorpora un bloque auxiliar, I2S2ext, que se
 * engancha al MISMO generador de reloj. Mode = MASTER_TX indica qué hace el
 * bloque principal; al activar FullDuplexMode el auxiliar toma la dirección
 * contraria.
 *
 * El STM32 debe ser maestro obligatoriamente: ni el amplificador ni el
 * micrófono pueden generar los relojes, ambos son siempre esclavos.
 *
 * Al compartir relojes, las dos direcciones quedan obligadas al mismo
 * formato. Como el micrófono trabaja en ranuras de 32 bits, todo el sistema
 * va a 32 bits.
 *
 * OJO CON LAS FUNCIONES ALTERNADAS: PB12, PB13 y PB15 pertenecen al SPI2
 * (AF5), pero PB14 pertenece al bloque extendido y usa AF6. Configurar los
 * cuatro con la misma AF es un error silencioso: transmitiría bien y la
 * recepción llegaría siempre en cero.
 */
static void i2s2_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_InitStruct.Pin       = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_15;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    GPIO_InitStruct.Pin       = GPIO_PIN_14;
    GPIO_InitStruct.Alternate = GPIO_AF6_I2S2ext;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    __HAL_RCC_SPI2_CLK_ENABLE();

    hi2s2.Instance            = SPI2;
    hi2s2.Init.Mode           = I2S_MODE_MASTER_TX;
    hi2s2.Init.Standard       = I2S_STANDARD_PHILIPS;
    hi2s2.Init.DataFormat     = I2S_DATAFORMAT_32B;
    hi2s2.Init.MCLKOutput     = I2S_MCLKOUTPUT_DISABLE;  /* no lo necesitan */
    hi2s2.Init.AudioFreq      = I2S_AUDIOFREQ_16K;
    hi2s2.Init.CPOL           = I2S_CPOL_LOW;
    hi2s2.Init.ClockSource    = I2S_CLOCK_PLL;
    hi2s2.Init.FullDuplexMode = I2S_FULLDUPLEXMODE_ENABLE;
    if (HAL_I2S_Init(&hi2s2) != HAL_OK) { trap_Error(); }
}

/* ═══════════════════════ I2C1: bus de la pantalla ═════════════════════════ */
/*
 * SCL = PB8, SDA = PB9 en AF4 y en drenador abierto, como exige el bus I2C:
 * los dispositivos solo tiran la línea a nivel bajo y las resistencias de
 * pull-up del módulo la suben.
 *
 * Velocidad de 100 kHz en lugar de 400 kHz. Con todo el cableado del montaje
 * (audio, parlante, encoder) la capacidad parásita del bus crece y a 400 kHz
 * los flancos se redondean lo suficiente como para que las transferencias
 * empiecen a fallar. A 100 kHz hay cuatro veces más tiempo de subida y el
 * volcado de la pantalla completa sigue tardando solo unos 100 ms.
 *
 * Sin interrupciones: el SSD1306 se maneja por sondeo.
 */
static void i2c1_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();

    /* Desatascar el bus antes de tomar los pines: recupera el sistema de un
     * reset ocurrido en mitad de una transferencia, situación en la que el
     * módulo deja la línea SDA bloqueada en nivel bajo.                    */
    SSD1306_BusRecover(GPIOB, GPIO_PIN_8, GPIOB, GPIO_PIN_9);

    GPIO_InitStruct.Pin       = GPIO_PIN_8 | GPIO_PIN_9;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    __HAL_RCC_I2C1_CLK_ENABLE();

    hi2c1.Instance             = I2C1;
    hi2c1.Init.ClockSpeed      = 100000;
    hi2c1.Init.DutyCycle       = I2C_DUTYCYCLE_2;
    hi2c1.Init.OwnAddress1     = 0;
    hi2c1.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2     = 0;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;
    if (HAL_I2C_Init(&hi2c1) != HAL_OK) { trap_Error(); }
}

/* ═══════════════════════ USART2: puerto serial por el VCP ═════════════════ */
/*
 * PA2/PA3 (AF7) están cableados internamente al Virtual COM Port del
 * ST-LINK, así que el serial viaja por el mismo cable USB de programación,
 * sin cableado adicional.
 *
 * Transmisión por sondeo; recepción de un carácter por interrupción, que es
 * lo que estrictamente lo requiere: los caracteres llegan en cualquier
 * momento y no se puede bloquear el lazo esperándolos.
 *
 * Se usa el driver ASÍNCRONO del HAL (UART_HandleTypeDef, HAL_UART_Init,
 * HAL_UART_Receive_IT). El driver síncrono requeriría una señal de reloj
 * adicional; el nombre "USART2" aparece solo porque así se llama la
 * instancia física del periférico en el F411.
 */
static void usart2_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_USART2_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitStruct.Pin       = GPIO_PIN_2 | GPIO_PIN_3;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    huart2.Instance          = USART2;
    huart2.Init.BaudRate     = 115200;
    huart2.Init.WordLength   = UART_WORDLENGTH_8B;
    huart2.Init.StopBits     = UART_STOPBITS_1;
    huart2.Init.Parity       = UART_PARITY_NONE;
    huart2.Init.Mode         = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&huart2) != HAL_OK) { trap_Error(); }

    HAL_NVIC_SetPriority(USART2_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
}

/* ═══════════════════════════════════════════════════════════════════════════
 *                    FUNCIONES DE CONTROL (APLICACIÓN / FSM)
 * ═══════════════════════════════════════════════════════════════════════════ */

