jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
/*
 * trap_Error — trampa de error de configuración.
 * Si una función HAL de inicialización devuelve algo distinto de HAL_OK, el
 * programa queda atrapado aquí. Con el debugger pausado, el call stack
 * indica exactamente qué configuración falló.
 */
static void trap_Error(void)
{
    while (1) { __NOP(); }
}

static void print(const char *s)
{
    HAL_UART_Transmit(&huart2, (uint8_t *)s, (uint16_t)strlen(s), 500);
}

/*
 * encoder_Poll — sondeo del contador del encoder.
 *
 * Un "paso" son ENC_COUNTS_PER_STEP cuentas, es decir tres clics mecánicos.
 * Como la división entera descarta el resto y solo se consumen los múltiplos
 * completos, los clics sobrantes quedan acumulados en el contador del timer
 * y se suman al siguiente giro: no se pierde movimiento, solo se exige más
 * recorrido por cambio.
 *
 * La resta se hace en aritmética modular de 16 bits, lo que maneja
 * correctamente el desborde del contador en ambos sentidos.
 */
static void encoder_Poll(void)
{
    uint16_t cnt   = (uint16_t)__HAL_TIM_GET_COUNTER(&htim1);
    int16_t  diff  = (int16_t)(cnt - enc_last_cnt);
    int16_t  pasos = (int16_t)(diff / ENC_COUNTS_PER_STEP);

    if (pasos != 0)
    {
        enc_last_cnt = (uint16_t)(enc_last_cnt +
                                  (uint16_t)(pasos * ENC_COUNTS_PER_STEP));

        /* Recorrido cíclico entre las tres opciones de tiempo */
        if (pasos > 0)
        {
            opcion_idx = (uint8_t)((opcion_idx + 1u) % OPCIONES);
        }
        else
        {
            opcion_idx = (uint8_t)((opcion_idx + OPCIONES - 1u) % OPCIONES);
        }

        if (fsm_state == FSM_IDLE) { fsm_state = FSM_PROC_ENCODER; }
    }
}

/*
 * boton_Poll — pulsador con detección de flanco.
 * Solo interesa la TRANSICIÓN de suelto a pulsado: sin esta comprobación,
 * mantener el botón generaría un evento en cada pasada del lazo.
 */
static void boton_Poll(void)
{
    uint8_t sw = (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_10) == GPIO_PIN_RESET)
                 ? 0u : 1u;

    if (sw_prev == 1u && sw == 0u)
    {
        if (fsm_state == FSM_IDLE) { fsm_state = FSM_PROC_BOTON; }
    }
    sw_prev = sw;
}

/*
 * text_Start — carga la línea recibida como palabra en curso.
 * Se llama al llegar el fin de línea: copia el buffer de ensamblado al de
 * trabajo, reinicia el índice y arranca el recorrido.
 */
static void text_Start(void)
{
    if (rx_len == 0u) { return; }        /* Enter sin texto: no hacer nada  */

    memcpy(text_buf, rx_line, rx_len);
    text_buf[rx_len] = '\0';
    text_len = rx_len;
    text_idx = 0;
    running  = 1;
    paused   = 0;

    rx_len = 0;                     /* listo para la siguiente palabra      */
    servos_Aplicar(mask_LetraActual());   /* colocar ya la primera letra */
    flag_refresh = 1;
}

/*
 * clip_Reproducir — arranca un clip de voz, cancelando el que estuviera
 * sonando.
 *
 * El orden de las asignaciones importa: primero se baja el interruptor para
 * que el callback deje de leer, después se cambian puntero y longitud, y
 * solo al final se vuelve a subir. Así el callback nunca puede encontrarse
 * con un puntero nuevo y una longitud vieja, que le haría leer fuera del
 * arreglo.
 */
static void clip_Reproducir(const int16_t *datos, uint32_t largo)
{
    clip_activo = 0;
    clip_datos  = datos;
    clip_largo  = largo;
    clip_pos    = 0;
    clip_activo = 1;

    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11, GPIO_PIN_SET);   /* ampli ON      */
}

/*
 * anuncio_Programar — arma la espera antes de hablar.
 * Se llama en cada cambio de opción. Al reescribir la marca de tiempo, cada
 * movimiento nuevo reinicia la cuenta, de modo que el anuncio solo sale
 * cuando el mando lleva VOZ_ESPERA_MS quieto. Es lo que evita encadenar
 * "uno, dos, tres" al girar rápido de un extremo al otro.
 */
static void anuncio_Programar(void)
{
    voz_pendiente   = 1;
    t_ultimo_cambio = HAL_GetTick();
}

/*
 * servos_Aplicar — punto de enganche para los seis servomotores.
 *
 * Recibe la misma máscara de 6 bits que dibuja la celda en pantalla, de modo
 * que motores y pantalla siempre muestran la misma letra: una sola fuente de
 * verdad. Cada bit corresponde a un punto del signo generador y decidirá si
 * ese servo sube o baja.
 *
 * Pendiente de implementar en la etapa de los servos.
 */

/*
 * servos_Aplicar — coloca los servos según la máscara de la letra actual.
 *
 * Recibe la MISMA máscara de 6 bits que dibuja la celda en pantalla, de modo
 * que motores y pantalla no pueden desincronizarse: hay una sola fuente de
 * verdad. Cada bit corresponde a un punto del signo generador y decide si
 * ese servo va a la posición levantada o retraída.
 *
 * Escribir el registro de comparación es una operación instantánea; el
 * hardware aplica el nuevo ancho de pulso en el siguiente periodo gracias al
 * preload del registro, así que nunca se emite un pulso a medias.
 */
static void servos_Aplicar(uint8_t mask)
{
    /* Correspondencia punto → timer y canal. Recorrerla en un bucle evita
     * repetir seis veces la misma comprobación.                           */
	static const struct
	{
		TIM_HandleTypeDef *htim;
		uint32_t           canal;
		uint8_t            bit;
	} tabla[6] =
	{
			{ &htim3, TIM_CHANNEL_1, BRAILLE_DOT_1 },   /* servo 1 — PA6 */
			{ &htim3, TIM_CHANNEL_2, BRAILLE_DOT_2 },   /* servo 2 — PA7 */
			{ &htim4, TIM_CHANNEL_1, BRAILLE_DOT_3 },   /* servo 3 — PB6 */
			{ &htim3, TIM_CHANNEL_4, BRAILLE_DOT_4 },   /* servo 4 — PB1 */
			{ &htim4, TIM_CHANNEL_2, BRAILLE_DOT_5 },   /* servo 5 — PB7 */
			{ &htim3, TIM_CHANNEL_3, BRAILLE_DOT_6 },   /* servo 6 — PB0 */
	};
    for (uint8_t i = 0; i < SERVOS_CONECTADOS; i++)
    {
        uint32_t pulso = (mask & tabla[i].bit) ? SERVO_PULSO_ALTO
                                               : SERVO_PULSO_BAJO;
        __HAL_TIM_SET_COMPARE(tabla[i].htim, tabla[i].canal, pulso);
    }
}

/*
 * mask_LetraActual — máscara Braille de la letra que se está mostrando.
 * Centraliza el caso especial de la 'ñ' (que se guarda con un código propio
 * porque no es ASCII) y el de los caracteres sin traducción, que devuelven
 * la celda vacía.
 */
static uint8_t mask_LetraActual(void)
{
    char    l = text_buf[text_idx];
    uint8_t m = ((uint8_t)l == 0xF1u) ? braille_GetMaskEnie()
                                      : braille_GetMask(l);
    return (m == BRAILLE_INVALID) ? 0u : m;
}

