jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
/*
 * ui_DrawBrailleCell — dibuja la celda de 6 puntos a partir de la máscara.
 *
 * Los puntos 1-2-3 forman la columna izquierda de arriba abajo y los 4-5-6 la
 * derecha, según la numeración del signo generador. Un punto activo se dibuja
 * como círculo relleno y uno inactivo como un recuadro pequeno, para que la
 * retícula siga siendo visible: así se aprecia qué puntos existen y cuáles
 * están levantados, igual que en las tablas del alfabeto Braille.
 */
static void ui_DrawBrailleCell(uint8_t mask)
{
    /* Tabla local: cada punto con su máscara y su posición. Recorrerla en un
     * bucle evita repetir seis veces la misma comprobación.                */
    static const struct { uint8_t bit; uint8_t x; uint8_t y; } dots[6] =
    {
        { BRAILLE_DOT_1, UI_CELL_COL_L, UI_CELL_ROW_1 },
        { BRAILLE_DOT_2, UI_CELL_COL_L, UI_CELL_ROW_2 },
        { BRAILLE_DOT_3, UI_CELL_COL_L, UI_CELL_ROW_3 },
        { BRAILLE_DOT_4, UI_CELL_COL_R, UI_CELL_ROW_1 },
        { BRAILLE_DOT_5, UI_CELL_COL_R, UI_CELL_ROW_2 },
        { BRAILLE_DOT_6, UI_CELL_COL_R, UI_CELL_ROW_3 },
    };

    for (uint8_t i = 0; i < 6u; i++)
    {
        if (mask & dots[i].bit)
        {
            SSD1306_DrawFilledCircle(dots[i].x, dots[i].y, UI_DOT_R);
        }
        else
        {
        	/* Punto inactivo: recuadro pequeño centrado en la misma
        	 * posición, igual que el indicador de opción no seleccionada.
        	 * Deja ver la retícula completa de la celda y se distingue sin
        	 * ambigüedad de un punto levantado.                           */
        	SSD1306_DrawEmptyRect((uint8_t)(dots[i].x - 2u),
        			(uint8_t)(dots[i].y - 2u), 4u, 4u);
        }
    }
}

/*
 * ui_DrawArrow — flecha horizontal que va de x0 a x1 a la altura y.
 *
 * Señala visualmente la relación entre la letra y su traducción: el asta se
 * dibuja con dos filas de píxeles para que se vea bien en un panel pequeño,
 * y la punta son dos diagonales que retroceden desde el extremo.
 */
static void ui_DrawArrow(uint8_t x0, uint8_t x1, uint8_t y)
{
    /* Asta de dos píxeles de grosor */
    SSD1306_DrawHLine(x0, x1, y);
    SSD1306_DrawHLine(x0, x1, (uint8_t)(y + 1u));

    /* Punta: diagonales que se abren hacia atrás desde el extremo */
    for (uint8_t i = 1u; i <= 4u; i++)
    {
        SSD1306_DrawPixel((uint8_t)(x1 - i), (uint8_t)(y - i), 1);
        SSD1306_DrawPixel((uint8_t)(x1 - i), (uint8_t)(y + 1u + i), 1);
    }
}

/*
 * ui_Draw — redibuja la pantalla completa.
 *
 * Se recompone toda la escena en cada refresco en lugar de actualizar zonas
 * sueltas: con 1024 bytes de framebuffer el costo es irrelevante y a cambio
 * se elimina por completo la posibilidad de restos de un dibujo anterior.
 *
 * El refresco solo ocurre cuando algo cambia (letra nueva, giro del encoder,
 * pausa, palabra nueva) y no de forma periódica, porque volcar la pantalla
 * por I2C ocupa el lazo unos 100 ms y no tiene sentido repetirlo sin motivo.
 */
static void ui_Draw(void)
{
	char    linea[48];
	char    letra;
	uint8_t mask;

	SSD1306_Fill(0);

	/* ── Encabezado (zona amarilla): palabra y posición ──                 */
	if (running)
	{
		snprintf(linea, sizeof(linea), "%s (%u/%u)", text_buf,
				(unsigned)(text_idx + 1u), (unsigned)text_len);
	}
	else
	{
		snprintf(linea, sizeof(linea), "Sin palabra");
	}
	SSD1306_WriteString(0, 0, linea);
	SSD1306_DrawHLine(0, 127, UI_SEP_Y);

	/* ── Zona azul: letra, flecha y celda Braille ──                       */
	if (running)
	{
		letra = text_buf[text_idx];
		mask  = mask_LetraActual();    /* la misma regla, un solo sitio */

		/* La 'ñ' se guarda con un código propio porque no es ASCII */
		if ((uint8_t)letra == 0xF1u)
		{
			/* La 'ñ' se dibuja como "N" con virgulilla encima, porque la
			 * fuente de 5x7 no la incluye.                               */
			SSD1306_WriteCharScaled(UI_LETTER_X, UI_LETTER_Y, 'N',
					UI_LETTER_SCALE);
			SSD1306_DrawHLine((uint8_t)(UI_LETTER_X + 2),
					(uint8_t)(UI_LETTER_X + 14),
					(uint8_t)(UI_LETTER_Y - 4));
		}
		else
		{
			SSD1306_WriteCharScaled(UI_LETTER_X, UI_LETTER_Y, letra,
					UI_LETTER_SCALE);
		}

		ui_DrawArrow(UI_ARROW_X0, UI_ARROW_X1, UI_ARROW_Y);

		/* Los caracteres sin traducción se muestran con la celda vacía */
		ui_DrawBrailleCell((mask == BRAILLE_INVALID) ? 0u : mask);
	}

	/* ── Tiempo vigente, a la derecha de la celda ──                       */
	snprintf(linea, sizeof(linea), "T=%us", (unsigned)tiempos[opcion_idx]);
	SSD1306_WriteString(UI_TIME_X, UI_TIME_Y, linea);

	/* ── Aviso de pausa, en la esqui na inferior ──                         */
	if (paused)
	{
		SSD1306_WriteString(UI_STATE_X, UI_STATE_Y, "PAUSA");
	}

	SSD1306_UpdateScreen();
}

/* ═══════════════════════ Máquina de estados (FSM) ═════════════════════════ */
/*
 * FSM dirigida por eventos. En FSM_IDLE se revisan las banderas que dejan
 * las interrupciones y el sondeo de encoder y pulsador; cada evento provoca
 * una transición a un estado que ejecuta UNA acción y vuelve a FSM_IDLE.
 *
 * El estado FSM_ANUNCIAR es especial: no se alcanza por una bandera sino por
 * una CONDICIÓN DE TIEMPO (hay anuncio pendiente y el mando lleva quieto lo
 * suficiente). Es la forma de implementar "hablar al detenerse" sin bloquear
 * el lazo ni gastar un temporizador.
 *
 * El orden de comprobación fija la prioridad: primero la entrada del usuario,
 * después el avance del secuenciador y el anuncio, y por último el
 * redibujado, que es lo más costoso.
 */
static void fsm_Run(void)
{
    switch (fsm_state)
    {
    case FSM_IDLE:
        if (flag_rx)        { fsm_state = FSM_PROC_UART;   }
        else if (flag_next) { fsm_state = FSM_NEXT_LETTER; }
        else if (voz_pendiente &&
                 ((HAL_GetTick() - t_ultimo_cambio) >= VOZ_ESPERA_MS))
        {
            fsm_state = FSM_ANUNCIAR;
        }
        else if (flag_refresh) { fsm_state = FSM_REFRESH_OLED; }
        break;

        /* ── Carácter recibido por el puerto serial ──                         */
    case FSM_PROC_UART:
    	flag_rx = 0;
    	{
    		uint8_t b = rx_byte;

    		/* Cada carácter aceptado se devuelve por el mismo puerto (eco).
    		 * El terminal no muestra lo que uno teclea: solo enseña lo que
    		 * llega desde la board, así que sin este eco se escribiría a
    		 * ciegas y no habría forma de detectar una errata.            */

    		/* La 'ñ' llega como la secuencia UTF-8 de dos bytes 0xC3 0xB1.
    		 * Al ver el primero se marca la espera; al llegar el segundo se
    		 * guarda con el código interno 0xF1, que cabe en un char y no
    		 * colisiona con ninguna letra ASCII.                           */
    		if (b == 0xC3u)
    		{
    			rx_utf8_pending = 1;
    		}
    		else if (rx_utf8_pending)
    		{
    			rx_utf8_pending = 0;
    			if (b == 0xB1u && rx_len < TEXT_MAX_LEN)
    			{
    				rx_line[rx_len++] = (char)0xF1;
    				print("\xC3\xB1");           /* eco de la 'ñ' */
    			}
    		}
    		else if (b == '\r' || b == '\n')
    		{
    			print("\r\n");
    			text_Start();                    /* fin de línea: arrancar */

