jjarbe/stm32-course-jgiraldoar/stm32proyecto_tallerv/Src/main.c
    			if (text_len > 0u)
    			{
    				char aviso[96];
    				snprintf(aviso, sizeof(aviso),
    						"Traduciendo \"%s\" (%u letras)\r\n\r\n> ",
							text_buf, (unsigned)text_len);
    				print(aviso);
    			}
    			else
    			{
    				print("> ");
    			}
    		}
    		else if (b == '\b' || b == 127u)
    		{
    			if (rx_len > 0u)
    			{
    				rx_len--;
    				/* Retroceder, tapar con un espacio y retroceder otra
    				 * vez: es la forma de borrar visualmente en un terminal
    				 * que solo entiende texto.                            */
    				print("\b \b");
    			}
    		}
    		else if (b >= 32u && b <= 126u && rx_len < TEXT_MAX_LEN)
    		{
    			rx_line[rx_len++] = (char)b;
    			HAL_UART_Transmit(&huart2, (uint8_t *)&b, 1, 100);
    		}
    		/* Cualquier otro byte se descarta en silencio, sin eco */
    	}
    	fsm_state = FSM_IDLE;
    	break;

    /* ── El mando giró un paso: ya se actualizó opcion_idx ──              */
    case FSM_PROC_ENCODER:
        anuncio_Programar();     /* la voz esperará a que el mando se pare  */
        flag_refresh = 1;        /* la pantalla sí cambia al instante       */
        fsm_state = FSM_IDLE;
        break;

    /* ── Se pulsó el mando: pausa o reanuda ──                             */
    case FSM_PROC_BOTON:
        paused = paused ? 0u : 1u;
        flag_refresh = 1;
        fsm_state = FSM_IDLE;
        break;

    /* ── Venció el tiempo: avanzar a la letra siguiente ──                 */
    case FSM_NEXT_LETTER:
        flag_next = 0;
        if (running && !paused && text_len > 0u)
        {
            text_idx++;
            if (text_idx >= text_len) { text_idx = 0; }   /* bucle          */

            /* Mover los servos a la letra nueva con la misma máscara que
             * después dibuja la celda en pantalla.                         */

            servos_Aplicar(mask_LetraActual());
            flag_refresh = 1;
        }
        fsm_state = FSM_IDLE;
        break;

    /* ── El mando se detuvo: anunciar el tiempo elegido ──                 */
    case FSM_ANUNCIAR:
        voz_pendiente = 0;
        switch (opcion_idx)
        {
        case 0:  clip_Reproducir(clip_uno,  clip_uno_largo);  break;
        case 1:  clip_Reproducir(clip_dos,  clip_dos_largo);  break;
        default: clip_Reproducir(clip_tres, clip_tres_largo); break;
        }
        fsm_state = FSM_IDLE;
        break;

    case FSM_REFRESH_OLED:
        flag_refresh = 0;
        ui_Draw();
        fsm_state = FSM_IDLE;
        break;

    default:
        fsm_state = FSM_IDLE;
        break;
    }
}

/* ═══════════════════════════════════════════════════════════════════════════
 *            ISR — CALLBACKS DE INTERRUPCIONES (equivalente HAL)
 *  Las ISR reales (los vectores del NVIC) están en stm32f4xx_it.c y delegan
 *  aquí a través de HAL_xxx_IRQHandler().
 * ═══════════════════════════════════════════════════════════════════════════ */

/*
 * HAL_TIM_PeriodElapsedCallback
 * La llama HAL_TIM_IRQHandler() en cada update de TIM10 (250 ms). Es
 * compartida por todos los timers con interrupción, así que hay que
 * verificar htim->Instance.
 *
 * Conmuta el LED de estado y lleva la cuenta del tiempo entre letras: al
 * acumular tiempo_en_segundos x 4 ticks, pide avanzar. El contador solo
 * avanza si hay palabra en curso y no está en pausa, de modo que el tiempo
 * no corre mientras el sistema está detenido.
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM10)
    {
        static uint8_t ticks = 0;

        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1);

        if (running && !paused)
        {
            ticks++;
            if (ticks >= (uint8_t)(tiempos[opcion_idx] * TICKS_PER_SECOND))
            {
                ticks = 0;
                flag_next = 1;
            }
        }
        else
        {
            ticks = 0;      /* al reanudar, el tiempo empieza de cero       */
        }
    }
}

/*
 * audio_Rellenar — vuelca la mitad del buffer de salida que el DMA acaba de
 * liberar.
 *
 * Si hay un clip en curso saca sus muestras una a una; si no, escribe
 * silencio. Al terminar el clip se apaga el amplificador por su pin SD, lo
 * que corta la etapa de salida y elimina el siseo de reposo entre anuncios.
 *
 * El recorrido va de 4 en 4 medias palabras (una trama) y la muestra se
 * escribe en los DOS canales, alineada a la izquierda dentro de la ranura de
 * 32 bits: así suena sea cual sea el canal que tenga seleccionado el
 * amplificador.
 */
static void audio_Rellenar(uint16_t offset)
{
    const uint16_t n = BUF_HALFWORDS / 2u;

    for (uint16_t i = 0; i < n; i += 4u)
    {
        int16_t salida = 0;

        if (clip_activo)
        {
            if (clip_pos < clip_largo)
            {
                salida = clip_datos[clip_pos++];
            }
            else
            {
                clip_activo = 0;                        /* fin del clip     */
                HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11, GPIO_PIN_RESET);
            }
        }

        tx_buf[offset + i]      = (uint16_t)salida;   /* L alto             */
        tx_buf[offset + i + 1u] = 0;                   /* L bajo             */
        tx_buf[offset + i + 2u] = (uint16_t)salida;   /* R alto             */
        tx_buf[offset + i + 3u] = 0;                   /* R bajo             */
    }
}

/*
 * Callbacks del audio en full-duplex. El HAL los invoca cuando la
 * transferencia conjunta llega a la mitad y cuando se completa; en ese
 * instante la mitad correspondiente ya se envió y puede reescribirse sin
 * competir con el DMA. Es el mecanismo de doble buffer.
 */
void HAL_I2SEx_TxRxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
    if (hi2s->Instance == SPI2) { audio_Rellenar(0); }
}

void HAL_I2SEx_TxRxCpltCallback(I2S_HandleTypeDef *hi2s)
{
    if (hi2s->Instance == SPI2) { audio_Rellenar(BUF_HALFWORDS / 2u); }
}

/*
 * HAL_UART_RxCpltCallback
 * La recepción por interrupción es de un solo uso: hay que rearmarla aquí
 * para el carácter siguiente.
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        flag_rx = 1;
        HAL_UART_Receive_IT(&huart2, (uint8_t *)&rx_byte, 1);
    }
}
